In [3]:
from IPython.display import Image
import numpy as np
import pandas as pd
import seaborn as sns

# import warnings
# warnings.filterwarnings('ignore')   # Turn off warnings

In [ ]:
'''통계'''

# 요약통계 describe()
# 개수 count()
# 평균 mean()
## 조건별 평균
# 중앙값 median()
# 합계 sum()
# 누적합, 누적곱 cumsum(), cumprod()
# 분산 var()
# 표준편차 std()
# 최대최소 min(), max()
# 통합 통계적용 agg
# 분위 quantile()
# 고유값, 고유값 개수 unique(), nunique()
# 최빈값 mode()
# 상관관계 corr()

'''기술툥계함수에서는 "skipna = True"가 기본 설정
False로 지정하면 NaN값이 있는 column은 NaN으로 표시됨
예) df.mean(skipna=False)'''

In [4]:
# 데이터셋 로드

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [11]:
df.describe(include="all")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [8]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [14]:
df['age'].count()

714

In [16]:
df.mean(numeric_only=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [17]:
df['age'].mean()

29.69911764705882

In [ ]:
# 조건별 평균

## 성인남성의 나이평균 구하기 
df.loc[
    df['adult_male'] == True, # 조건
    'age'
].mean()

33.17312348668281

In [ ]:
df.mean(numeric_only=True,skipna=False) # NaN값이 있는 column은 NaN으로 표시

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [22]:
df.mean(numeric_only=True,skipna=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [24]:
pd.Series([1,2,3,4,5]).median()

3.0

In [25]:
pd.Series([4,5,1,2,3]).median()

3.0

In [26]:
pd.Series([1,2,3,4,5,6]).median()

3.5

In [32]:
# 나이의 '평균과 중앙값은 약간의 차이가 있음' 확인

print(f"나이 평균: {df['age'].mean():.5f}\n나이 중앙값: {df['age'].median()}\n차이: {df['age'].mean() - df['age'].median():.5f}")

나이 평균: 29.69912
나이 중앙값: 28.0
차이: 1.69912

In [ ]:
df.loc[:,['age','fare']].sum() # 다중 컬럼 합계

age     21205.1700
fare    28693.9493
dtype: float64

In [ ]:
df['fare'].sum() # 단일 컬럼 합계

28693.9493

In [35]:
df['age'].cumsum()

0         22.00
1         60.00
2         86.00
3        121.00
4        156.00
         ...
886    21128.17
887    21147.17
888         NaN
889    21173.17
890    21205.17
Name: age, Length: 891, dtype: float64

In [36]:
df['age'].cumprod()

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

In [ ]:
# 평균
fare_mean = df['fare'].values.mean()
print('평균 :', f'{fare_mean:.5f}')

# 분산 (표본)
'''표본 데이터의 각 값이 평균과 얼마나 차이나는지(각 값들이 평균으로 부터 흩어진 정도) 제곱한 값들을 모두 더한 다음, 
표본 크기에서 1을 뺀 값으로 나눈 결과
=> (각 표본의 편차 제곱 합) / (표본 크기 - 1)'''

my_Var = ((df['fare'].values - fare_mean)**2).sum() / (df['fare'].count() - 1)
print(f"분산 :{my_Var : .5f}")

df['fare'].var()

평균 : 32.20421
분산 : 2469.43685

2469.436845743116

In [56]:
# 표준편차 = 분산의 제곱근
print(f"분산 : {np.sqrt(df['fare'].var()):.5f}")

df['fare'].std()

분산 : 49.69343

49.6934285971809

In [57]:
# 최소값 최대값

print(f"최소값 : {df['age'].min()}\n최대값 : {df['age'].max()}")

최소값 : 0.42
최대값 : 80.0

In [ ]:
df['age'].agg(['min','max','count','mean']) # 단일 컬럼에 적용

min        0.420000
max       80.000000
count    714.000000
mean      29.699118
Name: age, dtype: float64

In [59]:
df[['age','fare']].agg(['min','max','count','mean'])

              age        fare
min      0.420000    0.000000
max     80.000000  512.329200
count  714.000000  891.000000
mean    29.699118   32.204208

In [60]:
df['age'].quantile(0.1)

14.0

In [ ]:
df['who'].unique() # 고유값

array(['man', 'woman', 'child'], dtype=object)

In [ ]:
df['who'].nunique() # 고유값 갯수

3

In [ ]:
df['deck'].mode() # 최빈값

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [69]:
df.corr(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [68]:
df.corr(numeric_only=True)['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64

In [ ]:
'''연습문제
1. 승객의 나이 평균과 조건을 만족하는 데이터의 개수
fare를 30 이상 40 미만 지불한 승객 / pclass는 1등급

2. age 컬럼의 갯수 구하기

3. 컬럼의 평균'''

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# 승객의 나이 평균과 조건을 만족하는 데이터의 개수
# fare를 30 이상 40 미만 지불한 승객 / pclass는 1등급

con1 = (df['fare'] >= 30) & (df['fare'] < 40) & (df['pclass'] == 1)
# len(df[con1])

df.loc[con1, 'fare'].count()

28

In [93]:
# age 컬럼의 갯수 구하기

df.loc[con1,'age'].count()

21

In [94]:
# age 컬럼의 평균 구하기

df.loc[con1,'age'].mean(skipna=True)

44.095238095238095

In [ ]:
'''연습문제
다이아본드 데이터를 활용하여 문제 풀기

1. depth의 최소값

2. carat의 평균과 분산

3. x,y의 합계와 표준편차'''

In [96]:
# 다이아몬드 데이터 로드

diamond = sns.load_dataset('diamonds')
diamond.head()
diamond.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [99]:
diamond['depth'].min(skipna=True)

43.0

In [106]:
diamond['carat'].mean(skipna=True)
diamond['carat'].var()

0.22468665982277333

In [ ]:
# carat의 평균과 분산

diamond['carat'].agg(['mean','var'])

mean    0.797940
var     0.224687
Name: carat, dtype: float64

In [ ]:
# x,y의 합계와 표준편차

diamond[['x','y']].agg(['sum','std'])

                 x              y
sum  309138.620000  309320.330000
std       1.121761       1.142135

In [109]:
'''팽귄 데이터를 활용하여 다음의 문제 풀기
species 컬럼의 고유값 출력
island 컬럼의 최빈값 출력
body_mass_g 컬럼의 10% 분위수 값(하위 10%)출력
body_mass_g 컬럼의 80% 분위수 값(상위 20%)출력
'''

# load data
penguin = sns.load_dataset('penguins')
penguin

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [113]:
# species 컬럼의 고유값 출력

penguin['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [117]:
# island 컬럼의 최빈값 출력

penguin['island'].unique()
penguin['island'].value_counts()
penguin['island'].mode()

0    Biscoe
Name: island, dtype: object

In [118]:
# body_mass_g 컬럼의 10% 분위수 값(하위 10%)출력

penguin['body_mass_g'].quantile(0.1)

3300.0

In [119]:
# body_mass_g 컬럼의 80% 분위수 값(상위 20%)출력

penguin['body_mass_g'].quantile(.8)

4950.0